# Multi Index와 pivot table

#### multi index
- 인덱스를 계층적으로 만들 수 있다.

In [1]:
import pandas as pd
import numpy as np

In [13]:
#  인덱스를 계층적으로 만들 수 있다.
df = pd.DataFrame(
    np.random.randn(4,2),
    index = [['A', 'A', 'B', 'B'], [1, 2, 1, 2]],
    columns=['data1','data2']
)
df

        data1     data2
A 1 -1.181816 -0.598509
  2 -1.193247 -0.028841
B 1 -0.390706 -0.323057
  2  1.266676  0.716451

In [26]:
df.loc['A',1]['data1']
# df.iloc[0,:1]

-1.1818162073334035

In [5]:
# 열 인덱스도 계층적으로 만들 수 있다.
df = pd.DataFrame(
np.random.randn(4, 4),
columns=[["A", "A", "B", "B"], ["1", "2", "1", "2"]]
)
df

          A                   B
          1         2         1         2
0 -0.277957 -0.653274 -0.331124  1.444858
1  0.338050  0.453911  0.536507  0.379320
2 -1.525449  1.511510 -2.524339  1.282328
3  0.428773 -1.582312  0.901527  0.987238

In [6]:
df['A']

          1         2
0 -0.277957 -0.653274
1  0.338050  0.453911
2 -1.525449  1.511510
3  0.428773 -1.582312

In [7]:
df['A']['1']

0   -0.277957
1    0.338050
2   -1.525449
3    0.428773
Name: 1, dtype: float64

#### pivot_table
- 데이터에서 필요한 자료만 뽑아서 요약
    - index : 행 인덱스로 들어갈 key
    - column : 열 인덱스로 라벨링 될 값
    - value : 분석할 데이터

##### 타이타닉 데이터로 성별과 좌석별 생존률 구하기

In [27]:
df = pd.read_csv('./train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [30]:
table = df.pivot_table(values = 'Survived',
                       index = 'Sex',
                       columns = 'Pclass',)
table

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447